openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/test_apps/board/common/sdkconfig.ci.custom.BOARD_ESPRESSIF_ESP32_S3_LCD_EV_BOARD_2_V1_5
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM_MODE_OCT=y

CONFIG_ESP_PANEL_BOARD_DEFAULT_USE_CUSTOM=y
CONFIG_ESP_PANEL_BOARD_NAME="Custom_ESP32_S3_LCD_EV_BOARD_2_V1_5"
CONFIG_ESP_PANEL_BOARD_WIDTH=800
CONFIG_ESP_PANEL_BOARD_HEIGHT=480
CONFIG_ESP_PANEL_BOARD_USE_LCD=y
CONFIG_ESP_PANEL_LCD_CONTROLLER_ST7262=y
CONFIG_ESP_PANEL_BOARD_LCD_BUS_TYPE_RGB=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_USE_CONTROL_PANEL=n
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HPW=40
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HBP=40
CONFIG_ESP_PANEL_BOARD_LCD_RGB_HFP=40
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VPW=23
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VBP=32
CONFIG_ESP_PANEL_BOARD_LCD_RGB_VFP=13
CONFIG_ESP_PANEL_BOARD_LCD_RGB_PCLK_ACTIVE_NEG=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_BOUNCE_BUF_SIZE=8000
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA6=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA7=18
CONFIG_ESP_PANEL_BOARD_LCD_COLOR_BITS_RGB888=y
CONFIG_ESP_PANEL_BOARD_USE_TOUCH=y
CONFIG_ESP_PANEL_BOARD_TOUCH_CONTROLLER_GT1151=y
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_IO_SCL=48
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_IO_SDA=47
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_SCL_PULLUP=n
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_SDA_PULLUP=n
